GHB2/src/Catalogs/гхб_Автомобили/гхб_Автомобили.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_Автомобили</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Персональные</name>
      <description>Персональні</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Службові</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипАвтомобиля</name>
    <type>
      <types>EnumRef.гхб_ТипАвтомобиляСлужебныйПерсональный</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Enums/гхб_ТипАвтомобиляСлужебныйПерсональный/гхб_ТипАвтомобиляСлужебныйПерсональный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипАвтомобиляСлужебныйПерсональный</name>
  <enumValues>
    <name>Персональный</name>
  </enumValues>
  <enumValues>
    <name>Служебный</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Catalogs/гхб_Автомобили/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		
		Марка = СокрЛП(Марка);
		Модель = СокрЛП(Модель);
		ГосударственныйНомер = ВРег(СокрЛП(ГосударственныйНомер));
		
		Наименование = Марка + " " + ?(ЗначениеЗаполнено(Модель), Модель + " ", "") + ГосударственныйНомер;
		
		Если (ТипАвтомобиля = Перечисления.гхб_ТипАвтомобиляСлужебныйПерсональный.Персональный) И НЕ ПринадлежитЭлементу(Справочники.гхб_Автомобили.Персональные) Тогда
			Родитель = Справочники.гхб_Автомобили.Персональные;
		ИначеЕсли (ТипАвтомобиля = Перечисления.гхб_ТипАвтомобиляСлужебныйПерсональный.Служебный) И НЕ ПринадлежитЭлементу(Справочники.гхб_Автомобили.Служебные) Тогда
			Родитель = Справочники.гхб_Автомобили.Служебные;
		КонецЕсли;
		
		_АвтомобильСТакимЖеНомером = 
			Справочники.гхб_Автомобили.ВернутьАвтомобильПоГосударственномуНомеру(ГосударственныйНомер, Ссылка);
		
		Отказ = ЗначениеЗаполнено(_АвтомобильСТакимЖеНомером);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
